In [4]:
import pandas as pd
x = pd.DataFrame({"name":["ram","shyam","sita","gita","pappu","gabbar","pk","rancho"],"marks":[55,30,98,57,33,20,72,84],"result":["pass","fail","pass","pass","pass","fail","pass","pass"]},index=["a","b","c","d","e","f","g","h"])
z =x.iloc[4:10,0:2]
print(z)

     name  marks
e   pappu     33
f  gabbar     20
g      pk     72
h  rancho     84

In [10]:
import pandas as pd

In [11]:
# if you pass index than it put it in loc method:
a = pd.DataFrame({"name":["ram","shyam","sita","gita","pappu","gabbar","pk","rancho"],"marks":[55,30,98,57,33,20,72,84],"result":["pass","fail","pass","pass","pass","fail","pass","pass"]},index=["a","b","c","d","e","f","g","h"])
#print(a)
b = a.loc["a":"d",('name','marks')]
print(b)

    name  marks
a    ram     55
b  shyam     30
c   sita     98
d   gita     57

In [18]:
# drop column and drop rows;
# axis  = 1,show we can drop column wise data
# axis= 0,  we can drop row wise data
x = pd.DataFrame({"name":["ram","shyam","sita","gita","pappu","gabbar","pk","rancho"],"marks":[55,30,98,57,33,20,72,84],"result":["pass","fail","pass","pass","pass","fail","pass","pass"]},index=["a","b","c","d","e","f","g","h"])
z = x.drop("marks",axis=1)
print(z)

     name result
a     ram   pass
b   shyam   fail
c    sita   pass
d    gita   pass
e   pappu   pass
f  gabbar   fail
g      pk   pass
h  rancho   pass

In [19]:
x = pd.DataFrame({"name":["ram","shyam","sita","gita","pappu","gabbar","pk","rancho"],"marks":[55,30,98,57,33,20,72,84],"result":["pass","fail","pass","pass","pass","fail","pass","pass"]},index=["a","b","c","d","e","f","g","h"])
z =x.drop(["c","a","e"],axis=0)
print(z)

     name  marks result
b   shyam     30   fail
d    gita     57   pass
f  gabbar     20   fail
g      pk     72   pass
h  rancho     84   pass

In [20]:
d = x.max()
print(d)

name      sita
marks       98
result    pass
dtype: object

In [21]:
b =x.min()
print(b)

name      gabbar
marks         20
result      fail
dtype: object

In [22]:
print(x)

     name  marks result
a     ram     55   pass
b   shyam     30   fail
c    sita     98   pass
d    gita     57   pass
e   pappu     33   pass
f  gabbar     20   fail
g      pk     72   pass
h  rancho     84   pass

In [27]:
x = pd.DataFrame({"Name":["abc","xyz","awd"],"Marks":[78,76,92]},index =[1,2,3])
y = pd.DataFrame({"Name":["www","fff","ttt"],"Marks":[56,34,89]},index =[4,5,6])
z = (x,y)
w =pd.concat(z)
print(w)

  Name  Marks
1  abc     78
2  xyz     76
3  awd     92
4  www     56
5  fff     34
6  ttt     89

In [29]:
x = pd.DataFrame({"Name":["abc","xyz","awd"],"Marks":[78,76,92]},index =[1,2,3])
y = pd.DataFrame({"Name":["www","fff","ttt"],"Marks":[56,34,89]},index =[4,5,6])
z = pd.DataFrame({"Name":["amit","Arun","kiran"],"Marks":[76,89,87]},index =[7,8,9])
t =(x,y,z)
w = pd.concat(t)
print(w)

    Name  Marks
1    abc     78
2    xyz     76
3    awd     92
4    www     56
5    fff     34
6    ttt     89
7   amit     76
8   Arun     89
9  kiran     87

In [32]:
p =(z,x,y)
a = pd.concat(p)
print(a)

    Name  Marks
7   amit     76
8   Arun     89
9  kiran     87
1    abc     78
2    xyz     76
3    awd     92
4    www     56
5    fff     34
6    ttt     89

In [1]:
import pandas as pd

In [4]:

x = pd.DataFrame({"Name":["abc","xyz","awd"],"Marks":[78,76,92]},index =[1,2,3])
y = pd.DataFrame({"Name":["www","fff","ttt"],"Marks":[56,34,89]},index =[4,5,6])
z = x.append(y)
print(z)

  Name  Marks
1  abc     78
2  xyz     76
3  awd     92
4  www     56
5  fff     34
6  ttt     89

C:\Users\acer\AppData\Local\Temp\ipykernel_5484\1461333198.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  z = x.append(y)

In [5]:
 # use of merge

In [9]:
x = pd.DataFrame({"Name_1":["akash","arvind","sahil","binni","dabbie"],"Marks":[78,76,92,55,55]})
y = pd.DataFrame({"Name_2":["vinod","rahul","akash","omkar","dabbie"],"Marks":[56,34,89,74,33]})
print(x)
print(y)

   Name_1  Marks
0   akash     78
1  arvind     76
2   sahil     92
3   binni     55
4  dabbie     55
   Name_2  Marks
0   vinod     56
1   rahul     34
2   akash     89
3   omkar     74
4  dabbie     33

In [10]:
z =pd.merge(left =x,right =y,how ="inner",left_on ="Name_1",right_on="Name_2")
print(z)

   Name_1  Marks_x  Name_2  Marks_y
0   akash       78   akash       89
1  dabbie       55  dabbie       33

In [13]:
z =pd.merge(left =x,right =y,how ="inner",left_on ="Name_1",right_on="Name_2",indicator ="True")
print(z)

   Name_1  Marks_x  Name_2  Marks_y  True
0   akash       78   akash       89  both
1  dabbie       55  dabbie       33  both

In [17]:
a = pd.DataFrame({"Name_1":["akash","arvind","sahil","binni","dabbie"],"Marks":[78,76,92,55,55]})
b = pd.DataFrame({"Name_2":["vinod","rahul","akash","omkar","dabbie"],"Marks":[56,34,89,74,33]})
c = pd.merge(left =a,right =b,how ="outer",left_on ="Name_1",right_on="Name_2",indicator =True)
print(c)

   Name_1  Marks_x  Name_2  Marks_y      _merge
0   akash     78.0   akash     89.0        both
1  arvind     76.0     NaN      NaN   left_only
2   sahil     92.0     NaN      NaN   left_only
3   binni     55.0     NaN      NaN   left_only
4  dabbie     55.0  dabbie     33.0        both
5     NaN      NaN   vinod     56.0  right_only
6     NaN      NaN   rahul     34.0  right_only
7     NaN      NaN   omkar     74.0  right_only

In [18]:
a = pd.DataFrame({"Name_1":["akash","arvind","sahil","binni","dabbie"],"Marks":[78,76,92,55,55]})
b = pd.DataFrame({"Name_2":["vinod","rahul","akash","omkar","dabbie"],"Marks":[56,34,89,74,33]})
c = pd.merge(left =a,right =b,how ="right",left_on ="Name_1",right_on="Name_2",indicator =True)
print(c)

   Name_1  Marks_x  Name_2  Marks_y      _merge
0     NaN      NaN   vinod       56  right_only
1     NaN      NaN   rahul       34  right_only
2   akash     78.0   akash       89        both
3     NaN      NaN   omkar       74  right_only
4  dabbie     55.0  dabbie       33        both

In [19]:
a = pd.DataFrame({"Name_1":["akash","arvind","sahil","binni","dabbie"],"Marks":[78,76,92,55,55]})
b = pd.DataFrame({"Name_2":["vinod","rahul","akash","omkar","dabbie"],"Marks":[56,34,89,74,33]})
c = pd.merge(left =a,right =b,how ="left",left_on ="Name_1",right_on="Name_2",indicator =True)
print(c)

   Name_1  Marks_x  Name_2  Marks_y     _merge
0   akash       78   akash     89.0       both
1  arvind       76     NaN      NaN  left_only
2   sahil       92     NaN      NaN  left_only
3   binni       55     NaN      NaN  left_only
4  dabbie       55  dabbie     33.0       both

In [21]:
a = pd.DataFrame({"Name":["akash","arvind","sahil","binni","dabbie"],"Marks":[78,76,92,55,55]})
b = pd.DataFrame({"Name":["vinod","rahul","akash","omkar","dabbie"],"Marks":[56,34,89,74,33]})
c = pd.merge(left =a,right =b,how ="inner",left_on ="Name",right_on="Name",indicator =True)
print(c)

     Name  Marks_x  Marks_y _merge
0   akash       78       89   both
1  dabbie       55       33   both

In [22]:
# group by aggrigate

In [28]:
a = pd.DataFrame({"company":["google","google","yahoo","yahoo","tata","tata"],"person":["sonu","rakesh","dabbie","mukesh","saurav","pk"],"sales of india":[150,100,130,120,100,90]})
z =(a.groupby("company"))
print(z)
print(z.describe().transpose())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F405CA7E50>
company                   google        tata       yahoo
sales of india count    2.000000    2.000000    2.000000
               mean   125.000000   95.000000  125.000000
               std     35.355339    7.071068    7.071068
               min    100.000000   90.000000  120.000000
               25%    112.500000   92.500000  122.500000
               50%    125.000000   95.000000  125.000000
               75%    137.500000   97.500000  127.500000
               max    150.000000  100.000000  130.000000

In [29]:
z.describe()

        sales of india
                 count   mean        std    min    25%    50%    75%    max
company
google             2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0
tata               2.0   95.0   7.071068   90.0   92.5   95.0   97.5  100.0
yahoo              2.0  125.0   7.071068  120.0  122.5  125.0  127.5  130.0

In [39]:
z.min()

         sales of india
company
google              100
tata                 90
yahoo               120

In [32]:
z.mean()

         sales of india
company
google            125.0
tata               95.0
yahoo             125.0

In [43]:
z.min().transpose()["google"]

person            rakesh
sales of india       100
Name: google, dtype: object

In [33]:
a = pd.DataFrame({"class":["pass","pass","pass","fail","fail"],"name":["gabbar singh","shambha","basanti","jay","veeru"],"Marks":[78,76,92,30,20]})
b=a.groupby("class")

b.min()

          name  Marks
class
fail       jay     20
pass   basanti     76

b.describe().transpose()

In [34]:
b.max()

          name  Marks
class
fail     veeru     30
pass   shambha     92

In [39]:
a=[10,50,60,80,90]
min(a)
max(a)

90